##Use multi-index dataframes and cross section index, groupby

In [22]:

import pandas as pd

In [27]:
import numpy as np

In [2]:
## Creating a multi-leve index

In [38]:
out = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]

In [39]:
hier_index = list(zip(out,inside))

In [40]:
hier_index

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [41]:
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [42]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [43]:
from numpy.random import randn

In [44]:
df = pd.DataFrame(randn(6,2),hier_index,['A','B'])

In [45]:
df    ## multi-level index

             A         B
G1 1 -0.290214 -0.724700
   2  0.348826 -1.476418
   3  0.329490  1.223661
G2 1 -0.302461 -1.273523
   2 -0.384753  1.019640
   3 -0.510751  0.135019

In [46]:
## to find values from the dataframe

In [50]:
df.loc['G1']    ## starting from most outside index, and then proceed inside

          A         B
1 -0.290214 -0.724700
2  0.348826 -1.476418
3  0.329490  1.223661

In [51]:
df.loc['G1'].loc[1]  ## showing for index 1 under G1

A   -0.290214
B   -0.724700
Name: 1, dtype: float64

In [ ]:
## to name the indexes, you can use index.names method

In [53]:
df.index.names   ## right now it shows none

FrozenList([None, None])

In [54]:
df.index.names = ('Groups','Num')

In [56]:
df  ## now you can see outside index is names 'Groups' and inside index is 'Num'

                   A         B
Groups Num
G1     1   -0.290214 -0.724700
       2    0.348826 -1.476418
       3    0.329490  1.223661
G2     1   -0.302461 -1.273523
       2   -0.384753  1.019640
       3   -0.510751  0.135019

In [57]:
### to fetch a particulat value from datafram , let us try to find <135019>

In [58]:
df.loc['G2']

            A         B
Num
1   -0.302461 -1.273523
2   -0.384753  1.019640
3   -0.510751  0.135019

In [61]:
df.loc['G2'].loc[3]

A   -0.510751
B    0.135019
Name: 3, dtype: float64

In [63]:
df.loc['G2'].loc[3].B   ## there you have your value

np.float64(0.13501914205744917)

In [64]:
df

                   A         B
Groups Num
G1     1   -0.290214 -0.724700
       2    0.348826 -1.476418
       3    0.329490  1.223661
G2     1   -0.302461 -1.273523
       2   -0.384753  1.019640
       3   -0.510751  0.135019

In [ ]:
## let us try to fetch -1.476418

In [65]:
df.loc['G1'].loc[2].B

np.float64(-1.4764182242622732)

In [ ]:
## Cross section - xs function

In [66]:
## imagine you have to find all values in Index 1 under Num from both groups. With loc, it is typical and not so simple. With xs function, we
## can do this, just we have to define the level.

In [68]:
df.xs(1,level='Num')  ## lookin for all values in Index 1 under Num

               A         B
Groups
G1     -0.290214 -0.724700
G2     -0.302461 -1.273523

## MISSING DATA   -- dropna & fillna

In [70]:
## Creating a dictionary to be passed as dataframe

In [74]:
dic = {'A': [1,2,3] , 'B': [1,np.nan,3] , 'C': [1,np.nan,np.nan]}

In [75]:
df = pd.DataFrame(dic)

In [76]:
df

   A    B    C
0  1  1.0  1.0
1  2  NaN  NaN
2  3  3.0  NaN

In [77]:
## we can use dropna() method to drop any rows or columns which have one or more null/nan values

In [78]:
df.dropna()

   A    B    C
0  1  1.0  1.0

In [79]:
## to drop colmns, we can use axis along with dropna method

In [80]:
df.dropna(axis=1)

   A
0  1
1  2
2  3

In [ ]:
## we can set threshold value for how many nan we can have with dropna method

In [82]:
df.dropna(thresh=2)  ## you can see, we have index 2 which has only 1 nan value listed

   A    B    C
0  1  1.0  1.0
2  3  3.0  NaN

#filling the missing values using fillna method

In [92]:
df['B'].fillna(value=df['B'].mean()) ### taking an example to use mean value

0    1.0
1    2.0
2    3.0
Name: B, dtype: float64

In [91]:
df['C'].fillna(value=df['B'].mean())

0    1.0
1    2.0
2    2.0
Name: C, dtype: float64

In [88]:
df['A'].mean()

np.float64(2.0)

In [98]:
df.fillna(value = df['C'].mean())

   A    B    C
0  1  1.0  1.0
1  2  1.0  1.0
2  3  3.0  1.0

## GROUPBY

In [100]:
## It allows you to group rows based on a column and perform aggregate function on them

In [122]:
data = {'COMPANY':['LG','LG','SAMSUNG','NOKIA','LG','SAMSUNG'],'ITEMS':['TV','MusicSystem','Mobiles','Notepad','E-reader','Pad'],'Count':[200,210,160,58,90,101]}

In [123]:
df = pd.DataFrame(data)

In [124]:
df

   COMPANY        ITEMS  Count
0       LG           TV    200
1       LG  MusicSystem    210
2  SAMSUNG      Mobiles    160
3    NOKIA      Notepad     58
4       LG     E-reader     90
5  SAMSUNG          Pad    101

In [118]:
df.groupby('COMPANY')

In [119]:
grpby = df.groupby('COMPANY')

In [125]:
grpby.sum()

                         ITEMS  Count
COMPANY
LG       TVMusicSystemE-reader    500
NOKIA                  Notepad     58
SAMSUNG             MobilesPad    261

In [129]:
grpby.sum()

                         ITEMS  Count
COMPANY
LG       TVMusicSystemE-reader    500
NOKIA                  Notepad     58
SAMSUNG             MobilesPad    261

In [130]:
grpby.sum().loc['LG']

ITEMS    TVMusicSystemE-reader
Count                      500
Name: LG, dtype: object

In [131]:
grpby.count()

         ITEMS  Count
COMPANY
LG           3      3
NOKIA        1      1
SAMSUNG      2      2

In [132]:
grpby.max()

           ITEMS  Count
COMPANY
LG            TV    210
NOKIA    Notepad     58
SAMSUNG      Pad    160

In [133]:
grpby.describe()

        Count
        count        mean        std    min     25%    50%     75%    max
COMPANY
LG        3.0  166.666667  66.583281   90.0  145.00  200.0  205.00  210.0
NOKIA     1.0   58.000000        NaN   58.0   58.00   58.0   58.00   58.0
SAMSUNG   2.0  130.500000  41.719300  101.0  115.75  130.5  145.25  160.0

In [134]:
grpby.describe().transpose()

COMPANY              LG  NOKIA   SAMSUNG
Count count    3.000000    1.0    2.0000
      mean   166.666667   58.0  130.5000
      std     66.583281    NaN   41.7193
      min     90.000000   58.0  101.0000
      25%    145.000000   58.0  115.7500
      50%    200.000000   58.0  130.5000
      75%    205.000000   58.0  145.2500
      max    210.000000   58.0  160.0000

## Concatenation, Merge and join

In [138]:
df1 = {'A': ['A0','A1','A2'],'B': ['B0','B1','B2'],'C': ['C0','C1','C2']}

In [151]:
mydf1 = pd.DataFrame(df1,index=[0,1,2])

In [152]:
mydf1

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2

In [153]:
df2 = {'A': ['A3','A4','A5'],'B': ['B3','B4','B5'],'C':['C3','C4','C5']}

In [155]:
mydf2 = pd.DataFrame(df2,index=[3,4,5])

In [156]:
mydf2

    A   B   C
3  A3  B3  C3
4  A4  B4  C4
5  A5  B5  C5

In [146]:
df3 = {'A': ['A6','A7','A8'],'B': ['B6','B7','B8'],'C':['C6','C7','C8']}

In [157]:
mydf3 = pd.DataFrame(df3,index=[6,7,8])

In [158]:
mydf3

    A   B   C
6  A6  B6  C6
7  A7  B7  C7
8  A8  B8  C8

In [148]:
## so we have 3 dataframes with us: df1, df2 & df3 which we will use for our practice.

In [159]:
pd.concat([mydf1,mydf2,mydf3])

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2
3  A3  B3  C3
4  A4  B4  C4
5  A5  B5  C5
6  A6  B6  C6
7  A7  B7  C7
8  A8  B8  C8

In [ ]:
## We can join to different axis also. By default it is axis=0

In [161]:
pd.concat([mydf1,mydf2,mydf3],axis=1)  ## lot of nan values

     A    B    C    A    B    C    A    B    C
0   A0   B0   C0  NaN  NaN  NaN  NaN  NaN  NaN
1   A1   B1   C1  NaN  NaN  NaN  NaN  NaN  NaN
2   A2   B2   C2  NaN  NaN  NaN  NaN  NaN  NaN
3  NaN  NaN  NaN   A3   B3   C3  NaN  NaN  NaN
4  NaN  NaN  NaN   A4   B4   C4  NaN  NaN  NaN
5  NaN  NaN  NaN   A5   B5   C5  NaN  NaN  NaN
6  NaN  NaN  NaN  NaN  NaN  NaN   A6   B6   C6
7  NaN  NaN  NaN  NaN  NaN  NaN   A7   B7   C7
8  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8

In [162]:
## Merge - merge two dataframes

In [163]:
df4 = {'A': ['A0','A1','A2'],'B': ['B0','B1','B2'],'key': ['C0','C1','C2']}

In [182]:
df5 = {'C': ['A3','A4','A5','A6'],'D': ['B3','B4','B5','B6'],'key':['C0','C1','C2','C4']}

In [165]:
left = pd.DataFrame(df4)

In [166]:
left

    A   B key
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2

In [183]:
right = pd.DataFrame(df5)

In [184]:
right

    C   D key
0  A3  B3  C0
1  A4  B4  C1
2  A5  B5  C2
3  A6  B6  C4

In [170]:
## You can clearly see that 'Key' is the common column between both dataframes, which we can use to merge dataframes.

In [190]:
pd.merge(left,right,how='inner',on='key')  ## change the value of how and see the change happening

    A   B key   C   D
0  A0  B0  C0  A3  B3
1  A1  B1  C1  A4  B4
2  A2  B2  C2  A5  B5

Here are the different types of the JOINs in SQL:

    * (INNER) JOIN: Returns records that have matching values in both tables
    * LEFT (OUTER) JOIN: Returns all records from the left table, and the matched records from the right table
    * RIGHT (OUTER) JOIN: Returns all records from the right table, and the matched records from the left table
    * FULL (OUTER) JOIN: Returns all records when there is a match in either left or right table

In [191]:
## Joining -- very similar to merge, except here we join on base of similar keys and not columns

In [197]:
df6 = {'A': ['A0','A1','A2'],'B': ['B0','B1','B2']}

In [199]:
df7 = {'C': ['A3','A4','A5','A6'],'D': ['B3','B4','B5','B6']}

In [200]:
left1 = pd.DataFrame(df6,index=['k0','k1','k2'])

In [201]:
left1

     A   B
k0  A0  B0
k1  A1  B1
k2  A2  B2

In [203]:
right1 = pd.DataFrame(df7, index=['k0','k2','k3','k4'])

In [204]:
right1

     C   D
k0  A3  B3
k2  A4  B4
k3  A5  B5
k4  A6  B6

In [206]:
left1.join(right1)

     A   B    C    D
k0  A0  B0   A3   B3
k1  A1  B1  NaN  NaN
k2  A2  B2   A4   B4

In [209]:
left1.join(right1,how='outer')

      A    B    C    D
k0   A0   B0   A3   B3
k1   A1   B1  NaN  NaN
k2   A2   B2   A4   B4
k3  NaN  NaN   A5   B5
k4  NaN  NaN   A6   B6